This is a generated file for the l3build validation system.
Don't change this file in any respect.
(csl-citation-tests.tex
============================================================
TEST 1: Single cite item in a citation
============================================================
\g__csl_citation_count_ITEM-1_int=\count...
Package csl Warning: Citation `ITEM-1' on page 1 undefined on line ....
> \l__csl_citation_tl=\reset@font [\textbf {ITEM-1}].
<recently read> }
l. ...}
============================================================
============================================================
TEST 2: Multiple cite items in a citation
============================================================
\g__csl_citation_count_ITEM-1,ITEM-2_int=\count...
Package csl Warning: Citation `ITEM-1,ITEM-2' on page 1 undefined on line ....
> \l__csl_citation_tl=\reset@font [\textbf {ITEM-1,ITEM-2}].
<recently read> }
l. ...}
============================================================
============================================================
TEST 3: Citation with implicit page locator
============================================================
Package csl Warning: Citation `ITEM-1' on page 1 undefined on line ....
> \l__csl_citation_tl=\reset@font [\textbf {ITEM-1}].
<recently read> }
l. ...}
============================================================
============================================================
TEST 4: Citation with prefix and suffix
============================================================
Package csl Warning: Citation `ITEM-1' on page 1 undefined on line ....
> \l__csl_citation_tl=\reset@font [\textbf {ITEM-1}].
<recently read> }
l. ...}
============================================================
============================================================
TEST 5: Citation with suffix
============================================================
Package csl Warning: Citation `ITEM-1' on page 1 undefined on line ....
> \l__csl_citation_tl=\reset@font [\textbf {ITEM-1}].
<recently read> }
l. ...}
============================================================
============================================================
TEST 6: Citation with prefix
============================================================
Package csl Warning: Citation `ITEM-1' on page 1 undefined on line ....
> \l__csl_citation_tl=\reset@font [\textbf {ITEM-1}].
<recently read> }
l. ...}
============================================================
============================================================
TEST 7: Item in bibliography but no citation
============================================================
> \l__csl_citation_tl=.
<recently read> }
l. ...}
============================================================
============================================================
TEST 8: All items in bibliography but no citations
============================================================
> \l__csl_citation_tl=.
<recently read> }
l. ...}
============================================================
)
============================================================
TEST 9: Bibilography
============================================================
Package csl Warning: The bibliography is empty.
============================================================
[1
] (luatex-1-bibstyle-in-preamble.aux)
LaTeX Warning: There were undefined references.
