This is a generated file for the l3build validation system.
Don't change this file in any respect.
(csl-citation-tests.tex
============================================================
TEST 1: Single cite item in a citation
============================================================
> \l__csl_citation_tl=(D’Arcus, 2005).
<recently read> }
l. ...}
============================================================
============================================================
TEST 2: Multiple cite items in a citation
============================================================
> \l__csl_citation_tl=(Bennett, 2009; D’Arcus, 2005).
<recently read> }
l. ...}
============================================================
============================================================
TEST 3: Citation with page locator
============================================================
> \l__csl_citation_tl=(D’Arcus, 2005, p. 6).
<recently read> }
l. ...}
============================================================
============================================================
TEST 4: Citation with section locator
============================================================
> \l__csl_citation_tl=(D’Arcus, 2005, sec. 2.3).
<recently read> }
l. ...}
============================================================
============================================================
TEST 5: Citation with implicit page locator
============================================================
> \l__csl_citation_tl=(D’Arcus, 2005, p. 6).
<recently read> }
l. ...}
============================================================
============================================================
TEST 6: Citation with prefix and suffix
============================================================
> \l__csl_citation_tl=(prefix D’Arcus, 2005 suffix).
<recently read> }
l. ...}
============================================================
============================================================
TEST 7: Citation with implicit prefix and suffix
============================================================
> \l__csl_citation_tl=(prefix D’Arcus, 2005, suffix).
<recently read> }
l. ...}
============================================================
============================================================
TEST 8: Citation with implicit suffix
============================================================
> \l__csl_citation_tl=(D’Arcus, 2005, suffix).
<recently read> }
l. ...}
============================================================
============================================================
TEST 9: Citation with implicit prefix
============================================================
> \l__csl_citation_tl=(prefix D’Arcus, 2005).
<recently read> }
l. ...}
============================================================
============================================================
TEST 10: Multiple cite items with options
============================================================
> \l__csl_citation_tl=(Bennett, 2009, fig. 2; See D’Arcus, 2005, p. 6).
<recently read> }
l. ...}
============================================================
============================================================
TEST 11: Item in bibliography but no citation
============================================================
> \l__csl_citation_tl=.
<recently read> }
l. ...}
============================================================
)
============================================================
TEST 12: Bibilography
============================================================
(other-2-bibstyle-in-preamble.bbl)
The comma list \g__csl_bib_items_clist contains the items (without outer
braces):
>  {ITEM-2}
>  {ITEM-1}
>  {ITEM-3}.
<recently read> }
l. ...}
============================================================
[1
] (other-2-bibstyle-in-preamble.aux)
