This is a generated file for the l3build validation system.
Don't change this file in any respect.
(csl-citation-tests.tex
============================================================
TEST 1: Single cite item in a citation
============================================================
\g__csl_citation_count_ITEM-1_int=\count...
Package csl Warning: Citation `ITEM-1' on page 1 undefined on line ....
> \l__csl_citation_tl=[\textbf {ITEM-1}].
<recently read> }
l. ...}
============================================================
============================================================
TEST 2: Multiple cite items in a citation
============================================================
\g__csl_citation_count_ITEM-1,ITEM-2_int=\count...
Package csl Warning: Citation `ITEM-1, ITEM-2' on page 1 undefined on line ....
> \l__csl_citation_tl=[\textbf {ITEM-1, ITEM-2}].
<recently read> }
l. ...}
============================================================
============================================================
TEST 3: Citation with page locator
============================================================
Package csl Warning: Citation `ITEM-1' on page 1 undefined on line ....
> \l__csl_citation_tl=[\textbf {ITEM-1}].
<recently read> }
l. ...}
============================================================
============================================================
TEST 4: Citation with section locator
============================================================
Package csl Warning: Citation `ITEM-1' on page 1 undefined on line ....
> \l__csl_citation_tl=[\textbf {ITEM-1}].
<recently read> }
l. ...}
============================================================
============================================================
TEST 5: Citation with implicit page locator
============================================================
Package csl Warning: Citation `ITEM-1' on page 1 undefined on line ....
> \l__csl_citation_tl=[\textbf {ITEM-1}].
<recently read> }
l. ...}
============================================================
============================================================
TEST 6: Citation with prefix and suffix
============================================================
Package csl Warning: Citation `ITEM-1' on page 1 undefined on line ....
> \l__csl_citation_tl=[\textbf {ITEM-1}].
<recently read> }
l. ...}
============================================================
============================================================
TEST 7: Citation with suffix
============================================================
Package csl Warning: Citation `ITEM-1' on page 1 undefined on line ....
> \l__csl_citation_tl=[\textbf {ITEM-1}].
<recently read> }
l. ...}
============================================================
============================================================
TEST 8: Citation with prefix
============================================================
Package csl Warning: Citation `ITEM-1' on page 1 undefined on line ....
> \l__csl_citation_tl=[\textbf {ITEM-1}].
<recently read> }
l. ...}
============================================================
)
============================================================
TEST 9: Bibilography
============================================================
Package csl Warning: No file other-1-csl.bbl.
TRUE
============================================================
[1
] (other-1-csl.aux)
LaTeX Warning: There were undefined references.
