This is a generated file for the l3build validation system.
Don't change this file in any respect.
(csl-citation-tests.tex
============================================================
TEST 1: Single cite item in a citation
============================================================
> 
\l__csl_citation_info_tl=citationID={ITEM-1@1},citationItems={{id={ITEM-1}}},properties={noteIndex={0}}.
<recently read> }
l. ...}
> \l__csl_citation_tl=(D’Arcus, 2005).
<recently read> }
l. ...}
============================================================
============================================================
TEST 2: Multiple cite items in a citation
============================================================
> 
\l__csl_citation_info_tl=citationID={ITEM-1,ITEM-2@1},citationItems={{id={ITEM-1}},{id={ITEM-2}}},properties={noteIndex={0}}.
<recently read> }
l. ...}
> \l__csl_citation_tl=(Bennett, 2009; D’Arcus, 2005).
<recently read> }
l. ...}
============================================================
============================================================
TEST 3: Citation with page locator
============================================================
> 
\l__csl_citation_info_tl=citationID={ITEM-1@2},citationItems={{id={ITEM-1},label={page},locator={6}}},properties={noteIndex={0}}.
<recently read> }
l. ...}
> \l__csl_citation_tl=(D’Arcus, 2005, p. 6).
<recently read> }
l. ...}
============================================================
============================================================
TEST 4: Citation with section locator
============================================================
> 
\l__csl_citation_info_tl=citationID={ITEM-1@3},citationItems={{id={ITEM-1},label={section},locator={2.3}}},properties={noteIndex={0}}.
<recently read> }
l. ...}
> \l__csl_citation_tl=(D’Arcus, 2005, sec. 2.3).
<recently read> }
l. ...}
============================================================
============================================================
TEST 5: Citation with implicit page locator
============================================================
> 
\l__csl_citation_info_tl=citationID={ITEM-1@4},citationItems={{id={ITEM-1},label={page},locator={6}}},properties={noteIndex={0}}.
<recently read> }
l. ...}
> \l__csl_citation_tl=(D’Arcus, 2005, p. 6).
<recently read> }
l. ...}
============================================================
============================================================
TEST 6: Citation with prefix and suffix
============================================================
> 
\l__csl_citation_info_tl=citationID={ITEM-1@5},citationItems={{id={ITEM-1},prefix={prefix
},suffix={ suffix}}},properties={noteIndex={0}}.
<recently read> }
l. ...}
> \l__csl_citation_tl=(prefix D’Arcus, 2005 suffix).
<recently read> }
l. ...}
============================================================
============================================================
TEST 7: Citation with implicit prefix and suffix
============================================================
> 
\l__csl_citation_info_tl=citationID={ITEM-1@6},citationItems={{id={ITEM-1},prefix={prefix
},suffix={, suffix}}},properties={noteIndex={0}}.
<recently read> }
l. ...}
> \l__csl_citation_tl=(prefix D’Arcus, 2005, suffix).
<recently read> }
l. ...}
============================================================
============================================================
TEST 8: Citation with implicit suffix
============================================================
> 
\l__csl_citation_info_tl=citationID={ITEM-1@7},citationItems={{id={ITEM-1},suffix={,
suffix}}},properties={noteIndex={0}}.
<recently read> }
l. ...}
> \l__csl_citation_tl=(D’Arcus, 2005, suffix).
<recently read> }
l. ...}
============================================================
============================================================
TEST 9: Citation with implicit prefix
============================================================
> 
\l__csl_citation_info_tl=citationID={ITEM-1@8},citationItems={{id={ITEM-1},prefix={prefix
}}},properties={noteIndex={0}}.
<recently read> }
l. ...}
> \l__csl_citation_tl=(prefix D’Arcus, 2005).
<recently read> }
l. ...}
============================================================
============================================================
TEST 10: Narrative citation
============================================================
> 
\l__csl_citation_info_tl=citationID={ITEM-1@9},citationItems={{id={ITEM-1}}},properties={noteIndex={0},mode={composite}}.
<recently read> }
l. ...}
> \l__csl_citation_tl=D’Arcus (2005).
<recently read> }
l. ...}
============================================================
============================================================
TEST 11: Narrative citation
============================================================
> 
\l__csl_citation_info_tl=citationID={ITEM-1@10},citationItems={{id={ITEM-1}}},properties={infix={'s
early work},noteIndex={0},mode={composite}}.
<recently read> }
l. ...}
> \l__csl_citation_tl=D’Arcus’s early work (2005).
<recently read> }
l. ...}
============================================================
============================================================
TEST 12: Multiple cite items with options
============================================================
> 
\l__csl_citation_info_tl=citationID={ITEM-1,ITEM-2@2},citationItems={{id={ITEM-1},prefix={See
},label={page},locator={6}},{id={ITEM-2},label={figure},locator={2}}},properties={noteIndex={0}}.
<recently read> }
l. ...}
> \l__csl_citation_tl=(Bennett, 2009, fig. 2; See D’Arcus, 2005, p. 6).
<recently read> }
l. ...}
============================================================
============================================================
TEST 13: Cite only author
============================================================
> 
\l__csl_citation_info_tl=citationID={ITEM-1@11},citationItems={{id={ITEM-1}}},properties={noteIndex={0},mode={author-only}}.
<recently read> }
l. ...}
> \l__csl_citation_tl=D’Arcus.
<recently read> }
l. ...}
============================================================
============================================================
TEST 14: Uncited entry
============================================================
> 
\l__csl_citation_info_tl=citationID={@nocite},citationItems={{id={ITEM-3}}},properties={noteIndex={0}}.
<recently read> }
l. ...}
> \l__csl_citation_tl=.
<recently read> }
l. ...}
============================================================
)
============================================================
TEST 15: Bibliography
============================================================
The sequence \l__csl_bibliography_seq contains the items (without outer
braces):
>  {\cslsetup { class = in-text, hanging-indent = true, line-spacing = 2,
entry-spacing = 0, }}
>  {\begin {thebibliography}{}}
>  {\bibitem {ITEM-2} Bennett, F. G., Jr. (2009). Getting property right:
“informal” mortgages in the Japanese courts. \textit {Pac. Rim L. \&
Pol’y J.}, \textit {18}, 463–509.}
>  {\bibitem {ITEM-1} D’Arcus, B. (2005). \textit {Boundaries of dissent:
Protest and state power in the media age}. Routledge.}
>  {\bibitem {ITEM-3} Lamport, L. (1994). \textit {LaTeX: A document
preparation system: User’s guide and reference manual} (2nd ed.).
Addison-Wesley.}
>  {\end {thebibliography}}.
<recently read> }
l. ...}
============================================================
[1
] (bibstyle-in-preamble.aux)
